public/reading/stoicism/stoicism.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../reading.html">Reading</a> &gt;
</p>

<div id="outline-container-org1546e1c" class="outline-2">
<h2 id="org1546e1c">Stoicism</h2>
<div class="outline-text-2" id="text-org1546e1c">
<p>
Early stoicism's ethics is based on the idea that a wise man has the
duty to <b><b>live in accordance with the harmony of nature, through
reason, by being virtuous</b></b>. A virtuous man is someone that does not
follow pleasure or recreational activities, "To be violently drawn and
moved by the lusts and desires of the soul, is proper to wild beasts
an monsters" - Marcus Aurelius. A virtuous man is someone that
listens to everybody, that doesn't talk too much but not too little,
thankful to others, rigid when he needs to be&#x2026;
</p>

<p>
Some of the greatest stoic philosophers include <b><b>Zeno</b></b> (the first to
introduce stoicism), <b><b>Seneca</b></b> and the Roman emperor <b><b>Marcus
Aurelius</b></b> (there are many more which I did not mention for sake of
brevity).
</p>

<p>
I like stoicism for dealing with my anxieties and worries, but I do
not consider myself a good stoic, not even a decent one. To exercise
virtue I need to consistently do the good because, as Aristotele would
say, someone is said to be virtuous if his normal state of being is
being virtuous.
</p>

<p>
<a href="notes.html">Here</a> are a few notes from my readings.
</p>

<hr />

<p>
Travel: <a href="../reading.html">Reading</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
